       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILES-2.
       AUTHOR. NICOLO' MAFFI.
       INSTALLATION. RASPBERRY PY.
       DATE-WRITTEN. 19/12/2021.
       DATE-COMPILED. 19/12/2021.
       SECURITY. CONFIDENTIAL.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUSTOMERS-FILE ASSIGN TO "CUSTOMERS.dat"
               ORGANIZATION IS LINE SEQUENTIAL
               ACCESS IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD CUSTOMERS-FILE.
           01 CUSTOMER-DATA.
               02 ID-NUMBER      PIC 9(5).
               02 CUSTOMER-NAME.
                   03 F-NAME     PIC X(20).
                   03 L-NAME     PIC X(20).
       WORKING-STORAGE SECTION.
           01 WS-CUSTOMER-DATA.
               02 WS-ID-NUMBER      PIC 9(5).
               02 WS-CUSTOMER-NAME.
                   03 WS-F-NAME     PIC X(20).
                   03 WS-L-NAME     PIC X(20).
       PROCEDURE DIVISION.
           OPEN EXTEND CUSTOMERS-FILE
               DISPLAY "CUSTOMER ID: " WITH NO ADVANCING
               ACCEPT ID-NUMBER

               DISPLAY "CUSTOMER FIRST NAME: " WITH NO ADVANCING
               ACCEPT F-NAME

               DISPLAY "CUSTOMER LAST NAME: " WITH NO ADVANCING
               ACCEPT L-NAME
               WRITE CUSTOMER-DATA
               END-WRITE.
           CLOSE CUSTOMERS-FILE
       STOP RUN.
