       IDENTIFICATION DIVISION.
           PROGRAM-ID. HELLO-WORLD.
           AUTHOR. NICOLO' MAFFI.
           DATE-WRITTEN. 12/12/2021.
       PROCEDURE DIVISION.
           DISPLAY "HELLO WORLD!"
       STOP RUN.
