       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN-PROGRAM.
       AUTHOR. NICOLO' MAFFI.
       INSTALLATION. RASPBERRY PI.
       DATE-WRITTEN. 17/12/2021.
       DATE-COMPILED. 17/12/2021.
       SECURITY. CONFIDENTIAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 NUM1 PIC 99 VALUE IS 6.
           77 NUM2 PIC 99 VALUE IS 34.
           77 RES  PIC 9(4) VALUE IS ZEROS.
       PROCEDURE DIVISION.
           CALL 'SUM-PROGRAM' USING NUM1, NUM2, RES

           DISPLAY RES
       STOP RUN.
