       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRINGS.
       AUTHOR. NICOLO' MAFFI.
       INSTALLATION. RASPBERRY PI.
       DATE-WRITTEN. 19/12/2021.
       DATE-COMPILED. 19/12/2021.
       SECURITY. CONFIDENTIAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 SAMP-STR   PIC X(18) VALUE IS "eerie beef sneezed".
           77 NUM-CHARS  PIC 99 VALUE IS ZERO.
           77 NUM-ES     PIC 99 VALUE IS ZEROS.
           77 F-NAME     PIC X(6) VALUE IS 'MARTIN'.
           77 M-NAME     PIC X(11) VALUE IS 'LUTHER KING'.
           77 L-NAME     PIC X(4) VALUE IS "KING".
           77 F-L-NAME   PIC X(11).
           77 F-M-L-NAME PIC X(18).
           77 S-STR-1    PIC X(7) VALUE IS 'THE EGG'.
           77 S-STR-2    PIC X(9) VALUE IS 'IS #1 AND'.
           77 DEST       PIC X(33) VALUE IS 'IS THE BIG CHICKEN'.
           77 PTR        PIC 9 VALUE IS 1.
           77 S-STR-3    PIC X(3).
           77 S-STR-4    PIC X(3).
       PROCEDURE DIVISION.
      *    COUNTING CHARACTERS
           INSPECT SAMP-STR TALLYING NUM-CHARS FOR CHARACTERS
           DISPLAY "NUMBER OF CHARACTERS: " NUM-CHARS

      *    COUNTING ES
           INSPECT SAMP-STR TALLYING NUM-ES FOR ALL 'E'
           DISPLAY "NUMBERS OF ES: " NUM-ES

      *    CONVERTING TO UPPER CASE
           DISPLAY FUNCTION UPPER-CASE(SAMP-STR)

      *    CONVERTING TO LOWER CASE
           DISPLAY FUNCTION LOWER-CASE(SAMP-STR)

      *    JOIN STRINGS
           STRING F-NAME DELIMITED BY SIZE
           SPACE
           L-NAME DELIMITED BY SIZE
           INTO F-L-NAME
           DISPLAY F-L-NAME

           STRING F-L-NAME DELIMITED BY SPACES
           SPACE
           M-NAME DELIMITED BY SIZE
           SPACE
           L-NAME DELIMITED BY SIZE
           INTO F-M-L-NAME
           ON OVERFLOW DISPLAY 'OVERFLOWED'.
           DISPLAY F-M-L-NAME

           STRING S-STR-1 DELIMITED BY SIZE
           SPACE
           S-STR-2 DELIMITED BY "#"
           INTO DEST
           WITH POINTER PTR
           ON OVERFLOW DISPLAY 'OVERFLOWED'
           END-STRING
           DISPLAY DEST

      *    SPLITTING STRINGS
           UNSTRING S-STR-1 DELIMITED BY SPACE
           INTO S-STR-3, S-STR-4
           END-UNSTRING
           DISPLAY "[" S-STR-3 "] [" S-STR-4 "]"
       STOP RUN.
