       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. NICOLO` MAFFI.
       INSTALLATION. RASPBERRY PI.
       DATE-WRITTEN. 12/12/2021.
       DATE-COMPILED. 12/12/2021.
       SECURITY. CONFIDENTIAL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY "HELLO WORLD!"
       STOP RUN.
