       IDENTIFICATION DIVISION.
           PROGRAM-ID. HELLO-WORLD.
           AUTHOR. NICOLO` MAFFI.
           INSTALLATION. 12/12/2021.
           DATE-WRITTEN. 12/12/2021.
           DATE-COMPILED. 12/12/2021.
           SECURITY. DON`T KNOW.
       PROCEDURE DIVISION.
           DISPLAY "HELLO WORLD!"
       STOP RUN.
