       IDENTIFICATION DIVISION.
       PROGRAM-ID. MATH-COMPUTE.
       AUTHOR. NICOLO` MAFFI.
       INSTALLATION. RASPBERRY PI.
       DATE-WRITTEN. 13/12/2021.
       DATE-COMPILED. 13/12/2021.
       SECURITY. CONFIDENTIAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 NUM1 PIC S9(4)V9(3).
           77 NUM2 PIC S9(4)V9(3).
           77 RES  PIC S9(8)V9(3). 
       PROCEDURE DIVISION.
           DISPLAY "FIRST NUMBER: " WITH NO ADVANCING
           ACCEPT NUM1

           DISPLAY "SECOND NUMBER: " WITH NO ADVANCING
           ACCEPT NUM2

           COMPUTE RES = NUM1 + NUM2
           DISPLAY NUM1 " + " NUM2 " = " RES

           COMPUTE RES = NUM1 - NUM2
           DISPLAY NUM1 " - " NUM2 " = " RES

           COMPUTE RES = NUM1 * NUM2
           DISPLAY NUM1 " * " NUM2 " = " RES

           IF NUM2 IS EQUALS TO ZERO THEN
               DISPLAY "ERROR: DIVISION BY ZERO!"
           ELSE
               COMPUTE RES = NUM1 / NUM2
               DISPLAY NUM1 " / " NUM2 " = " RES
           END-IF

           COMPUTE RES = NUM1 ** NUM2
           DISPLAY RES

           COMPUTE RES ROUNDED = 10.6 + 9.0005
           DISPLAY RES
       STOP RUN.
