       IDENTIFICATION DIVISION.
       PROGRAM-ID. MATH.
       AUTHOR. NICOLO` MAFFI.
       INSTALLATION. RASPBERRY PI.
       DATE-WRITTEN. 12/12/2021.
       DATE-COMPILED. 12/12/2021.
       SECURITY. CONFIDENTIAL.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           77 NUM1 PIC S9(4)V9(3).
           77 NUM2 PIC S9(4)V9(3).
           77 RES  PIC S9(8)V9(3). 
       PROCEDURE DIVISION.
           DISPLAY "FIRST NUMBER: " WITH NO ADVANCING
           ACCEPT NUM1

           DISPLAY "SECOND NUMBER: " WITH NO ADVANCING
           ACCEPT NUM2

           ADD NUM2 TO NUM1 GIVING RES
           DISPLAY NUM1 " + " NUM2 " = " RES

           SUBTRACT NUM2 FROM NUM1 GIVING RES
           DISPLAY NUM1 " - " NUM2 " = " RES

           MULTIPLY NUM1 BY NUM2 GIVING RES
           DISPLAY NUM1 " * " NUM2 " = " RES

           IF NUM2 IS EQUALS TO ZERO THEN
               DISPLAY "ERROR: DIVISION BY ZERO!"
           ELSE
               DIVIDE NUM2 INTO NUM1 GIVING RES
               DISPLAY NUM1 " / " NUM2 " = " RES
           END-IF
       STOP RUN.
