       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARAGRAPHS.
       AUTHOR. NICOLO' MAFFI.
       INSTALLATION. RASPBERRY PI.
       DATE-WRITTEN. 17/12/2021.
       DATE-COMPILED. 17/12/2021.
       SECURITY. CONFIDENTIAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           MAIN-PARAGRAPH.
               DISPLAY "YOU ARE IN MAIN PARA!"
               PERFORM SECOND-PARAGRAPH
               DISPLAY "RETURNED TO MAIN PARA FROM SECOND PARA!"
               PERFORM 2 TIMES
                   DISPLAY "REPEAT PERFOMR"
               END-PERFORM

               PERFORM FOURTH-PARAGRAPH 2 TIMES
               DISPLAY "RETURNED TO MAIN PARA FROM FOURTH PARA!"
      *    YOU CAN PUT ALSO -> PERFORM END-PARAGRAPH
           STOP RUN.

           THIRD-PARAGRAPH.
               DISPLAY "YOU ARE IN THIRD PARA!".

           SECOND-PARAGRAPH.
               DISPLAY "YOU ARE IN SECOND PARA!"
               PERFORM THIRD-PARAGRAPH
               DISPLAY "RETURNED TO SECOND PARA FROM THIRD PARA!".

           FOURTH-PARAGRAPH.
               DISPLAY "YOU ARE IN FOURTH PARAGRAPH!".

           END-PARAGRAPH.
               DISPLAY "END PARAGRAPH".

       STOP RUN.
