      * COMPILE WITH -> cobc -m PROGRAM-NAME.COB
      * OR WITH -> cobc PROGRAM-NAME.COB
       
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUM-PROGRAM.
       AUTHOR. NICOLO' MAFFI.
       INSTALLATION. RASPBERRY PI.
       DATE-WRITTEN. 17/12/2021.
       DATE-COMPILED. 17/12/2021.
       SECURITY. CONFIDENTIAL.
       DATA DIVISION.
       LINKAGE SECTION.
           77 NUM1 PIC 99 VALUE IS ZEROS.
           77 NUM2 PIC 99 VALUE IS ZERO.
           77 RES  PIC 9(4) VALUE IS 0.
       PROCEDURE DIVISION USING NUM1, NUM2, RES.
           COMPUTE RES = NUM1 + NUM2
       EXIT PROGRAM.
